Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ལོ་ཏོག་རྣམས་ཀྱང་འབྲས་བུ་མེད་པ་དང་མཐུ་མེད་པར་འགྱུར་ལ། དེ་དག་ཀྱང་སེར་བས་མེད་པར་བྱེད་དོ། །
en: the harvests and fruits will lack any vitality, and they will also be devastated by hail.

source: འབྲུ་རྣམས་ཀྱང་མ་རུང་བར་གྱུར་པས་མུ་གེ་འབྱུང་བར་འགྱུར་རོ། །
en: The grain too will be ruined, and there will be famine.

source: མུ་གེ་བྱུང་ནས་མི་རྣམས་ཟས་སུ་ཁྲེ་རྒོད་ཟ་བར་འགྱུར་ཏེ།
en: When the famine occurs, human beings will be forced to eat wild millet.

source: ཉམ་སྟོབས་ཆུང་ཞིང་གཟི་བྱིན་ཆུང་བར་འགྱུར་རོ། །
en: They will have little strength and their life force will diminish.

source: ཤ་ཀའི་མི་དང་ཡ་བ་ན་དང་བ་ལྷི་ཀ་དང་རྒྱལ་པོ་དང་ཆོམ་རྐུན་གྱིས་འཇིག་རྟེན་རྣམས་ལ་གནོད་པ་བྱེད་པར་འགྱུར་རོ། །
en: “Śakas, Yavanas, Bāhlikas, kings, and brigands will harm the living.

source: ཤ་ཀའི་མི་དང་ཡ་བ་ན་དང་བ་ལྷི་ཀ་དང་རྒྱལ་པོ་དང་ཆོམ་རྐུན་གྱིས་གནོད་པ་བྱས་ནས་དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར་དང་མཆེ་བ་དང་ལྷུང་བཟེད་མཆོད་རྟེན་དང་འདྲ་བ་རྣམས་ཤར་ཕྱོགས་ཀྱི་ཡུལ་དུ་ཁྱེར་བའི་འོག་ཏུ་ལྷོ་ཕྱོགས་ནས་མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་ཤ་ཀ་ཞེས་བྱ་བ་གཡོག་འཁོར་འབུམ་དང་ལྡན་པ་འོང་བར་འགྱུར་ཏེདགེ་འདུན་གྱི་གཙུག་ལག་ཁང་རྣམས་འཇིག་པར་བྱེད་ཅིང་། མཆོད་རྟེན་རྣམས་འདྲལ་བར་བྱེད་ལ་དགེ་སློང་རྣམས་ཀྱང་གསོད་པར་བྱེད་དོ། །
en: After the Śakas, Yavanas, Bāhlikas, kings, and brigands have done their harm, they will also seize the Tathāgata’s crown protrusion, eye teeth, alms bowl, stūpas, and such, and take them east. After that a king of the barbaric outlying regions named Śaka will come from the south with a suite of a hundred thousand attendants, raze the monasteries of the saṅgha, tear down the stūpas, and slay the monks.

source: ནུབ་ཕྱོགས་ནས་ནི་མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་བ་ལྷི་ཀ་ཞེས་བྱ་བ་གཡོག་འཁོར་འབུམ་དང་ལྡན་པ་འོང་བར་འགྱུར་ཏེ། དགེ་འདུན་གྱི་གཙུག་ལག་ཁང་རྣམས་འཇིག་པར་བྱེད་ཅིང་། མཆོད་རྟེན་རྣམས་འདྲལ་བར་བྱེད་ལ་དགེ་སློང་རྣམས་ཀྱང་གསོད་པར་བྱེད་དོ། །
en: “A king of the barbaric outlying regions named Bāhlika will come from the west with a suite of a hundred thousand attendants, raze the monasteries of the saṅgha, tear down the stūpas, and slay the monks.

source: བྱང་ཕྱོགས་ནས་ནི་མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་ཡ་བ་ན་ཞེས་བྱ་བ་གཡོག་འཁོར་འབུམ་དང་ལྡན་པ་འོང་བར་འགྱུར་ཏེ། དགེ་འདུན་གྱི་གཙུག་ལག་ཁང་རྣམས་འཇིག་པར་བྱེད་ཅིང་མཆོད་རྟེན་རྣམས་འདྲལ་བར་བྱེད་ལ། དགེ་སློང་རྣམས་ཀྱང་གསོད་པར་བྱེད་དོ། །
en: “A king of the barbaric outlying regions named Yavana will come from the north with a suite of a hundred thousand attendants, raze the monasteries of the saṅgha, tear down the stūpas, and slay the monks.

source: དེས་ན་མི་དང་ཆོམ་རྐུན་དང་རྒྱལ་པོའི་ནན་གྱིས་དཔྱས་གནོད་པར་གྱུར་ནས། དགེ་སློང་རྣམས་ཤར་ཕྱོགས་ཀྱི་ཡུལ་དུ་འདོང་བར་འགྱུར་རོ། །
en: Because of all this, the people and the robbers will blame and harm one another, and the monks will wish to travel east.

source: དབང་པོ་དག་དེའི་ཚེ་ཡུལ་ཀཽ་ཤཱཾ་བཱི་ཞེས་བྱ་བར་རྒྱལ་པོ་དབང་ཆེན་སྡེ་ཞེས་བྱ་བ། གཡོག་འཁོར་འབུམ་དང་ལྡན་པ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ།
en: “Lords, at that time a king named Mahendrasena will rule in Kauśāmbī with a suite of a hundred thousand attendants.

source: དེའི་བུ་ལུས་གོ་ཆ་གྱོན་པ་ལག་པ་ཁྲག་ཅན་ཚན་པོ་ཆེའི་སྟོབས་དང་ལྡན་པ་ཞིག་བཙའ་བར་འགྱུར་ལ།
en: When his son is born, he will be wearing armor on his body, have blood on his hands, and be tremendously strong.

source: དེ་ཁོ་ནའི་ཉིན་པར་རྒྱལ་པོ་དེའི་བློན་པོ་ལྔ་བརྒྱའི་བུ་ཡང་། ལུས་གོ་ཆ་གྱོན་པ་ལག་པ་ཁྲག་ཅན་ཚན་པོ་ཆེའི་སྟོབས་དང་ལྡན་པ་ཤ་སྟག་བཙའ་བར་འགྱུར་ཏེ
en: On the same day, sons will also be born to the king’s five hundred ministers who are wearing armor, have blood on their hands, and are tremendously strong.

source: དེ་ཁོ་ནའི་ཉིན་པར་ཡུལ་ཀཽ་ཤཱཾ་བཱིར་ཁྲག་གི་ཆར་འབབ་པར་འགྱུར་རོ། །
en: “On that day a rain of blood will fall on Kauśāmbī.

source: དེ་ནས་རྒྱལ་པོས་མཚན་མཁན་རྣམས་ལ་སྨྲས་ན། དེ་དག་ན་རེ་ལྷ་འདི་ནི་ས་སྟེང་ཐམས་ཅད་དུ་རྒྱལ་པོ་གཅིག་པུར་འགྱུར་ཏེ། དེ་ལྟ་ལགས་ཀྱིས་ཀྱང་སེམས་ཅན་མང་པོ་ཁ་འདོག་པར་འགྱུར་ལགས་སོ་ཞེས་ལུང་བསྟན་ཏོ།།
en: When the king consults the soothsayers, they will issue a prophecy saying, ‘Deva, he will become the sole sovereign over the whole world, but he will slaughter many beings.’

source: དེ་ནས་བཙས་སྟོན་བྱས་ནས་བུ་དེ་ཆེ་བར་གྲགས་པ་དང་བཟོད་པར་དཀའ་བ་ཞིག་སྟེ། དེའི་མིང་བཟོད་པར་དཀའ་བ་ཞེས་བྱ་བར་འདོགས་པར་འགྱུར་རོ། །
en: “At the elaborate feast celebrating the birth of the king’s son, they will name him, saying, ‘Since he is infamous and overwhelming, his name will be Duṣprasaha.’

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་དེ་དག་གིས་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཁ་འདོག་པར་བྱེད་ཅིང་ཤར་ཕྱོགས་ཀྱི་ཡུལ་དུ་འགྲོ་བར་འགྱུར་རོ། །
en: As he grows up, the kings of the barbaric outlying regions will slaughter many people over twelve years and then travel east.

source: དེ་ནས་རྒྱལ་པོ་དབང་ཆེན་སྡེས་དེ་ཐོས་ཏེ། འཇིགས་ཤིང་མི་དགའ་བ་སྐྱེས་ནས། དེ་ལ་ལྷ་རྣམས་ཀྱིས་བསྟན་པ།
en: When King Mahendrasena hears of it, he will become fearful and unhappy, and the gods will advise him,

source: གཞོན་ནུ་བཟོད་པར་དཀའ་བ་རྒྱལ་སར་ཆུག་ཤིག་དང་།
en: ‘Let young Duṣprasaha be king,

source: དེས་མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་དེ་དག་ཚར་ཆོད་པར་འགྱུར་རོ་ཞེས་སྟོན་པར་འགྱུར་རོ། །
en: and he will defeat the kings of the barbaric outlying regions once and for all.’

source: དེ་ནས་རྒྱལ་པོ་དབང་ཆེན་སྡེས་མགོ་བོ་ལས་ཅོད་པན་དང་དབུ་རྒྱན་ཕུད་དེ། གཞོན་ནུ་བཟོད་པར་དཀའ་བ་རྒྱལ་སར་བཅུག་པར་འགྱུར་རོ། །
en: “Thereupon King Mahendrasena will remove the crown and diadem from his head and grant them to young Duṣprasaha,

source: དེ་ནས་རྒྱལ་པོ་བཟོད་པར་དཀའ་བས་བློན་པོ་ལྔ་བརྒྱའི་བུ་དེ་དག་བློན་པོའི་མཆོག་ཏུ་བཅུག་ནས།
en: at which point King Duṣprasaha will appoint the sons of Mahendrasena’s five hundred ministers as his chief ministers.

source: བློན་པོ་ལྔ་བརྒྱ་པོ། དེ་དག་དང་ལྷན་ཅིག་ཏུ་གོ་བགོས་ཏེ། མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་དེ་དག་དང་གཡུལ་འགྱེད་པའི་ཕྱིར་འདྲེན་པར་འགྱུར་ཏེ།
en: He and his five hundred ministers will don their armor and he will lead them into battle against the kings of the barbaric outlying lands.

source: དེས་མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་གསུམ་པོ་གཡོག་འཁོར་འབུམ་འབུམ་དང་ལྡན་པ་དེ་དག་ཁ་བཏགས་ནས། སའི་སྟེང་ཐམས་ཅད་དུ་རྒྱལ་པོ་གཅིག་པུར་འགྱུར་ཏེ།
en: “They will slaughter the three kings of the barbaric outlying lands along with the hundreds upon hundreds of thousands in their retinue, and he shall become the sole sovereign over the whole world.

source: བཀའ་འོག་ཏུ་བཅུག་ནས་ཕྱིར་ཀཽ་ཤཱཾ་བཱིར་འོང་བར་འགྱུར་རོ། །
en: He shall bring them under his command and then return to Kauśāmbī.

source: དབང་པོ་དག་དེའི་ཚེ་ཡུལ་དམར་ཅན་གྱི་བུ་ཞེས་བྱ་བར་བྲམ་ཟེ་མེས་སྦྱིན་ཞེས་བྱ་བ།
en: “Lords, at that time in Pāṭaliputra there will appear a brahmin called Agnidatta ,

source: རིག་བྱེད་དང་རིག་བྱེད་ཀྱི་ཡན་ལག་མཐར་ཕྱིན་པ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ
en: a master of the Vedas and the supplements to the Vedas.

source: དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པར་འགྱུར་ལ། སེམས་ཅན་གཞན་ཞིག་ཀྱང་དེའི་ཆུང་མའི་ལྟོར་འཇུག་པར་འགྱུར་རོ། །
en: When the time comes for him to marry, he will take a wife, they will enjoy themselves and couple, and a being will enter his wife’s womb.

source: དེ་ནས་བྲམ་ཟེ་མོ་དེ་ཡིད་ལ་འདོད་པ་སྐྱེས་ཏེ།
en: Then his wife the brahmiṇī will begin to think things like,

source: གཞུང་གིས་རྩོད་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་སྨྲ་ཡང་ཅི་མ་རུང་སྙམ་མོ། །
en: ‘Wouldn’t it be good to converse with those who debate the scriptures!’

source: དེ་ནས་བྲམ་ཟེ་དེས་མཚན་མཁན་རྣམས་ལ་བསྟན་ནས།
en: “The brahmin will consult the soothsayers

source: མཚན་མཁན་རྣམས་ན་རེ་ལྟོ་ན་འདུག་པའི་སེམས་ཅན་དེ་བསྟན་བཅོས་ཐམས་ཅད་རྟོགས་པར་འགྱུར་ཞིང་། གཞུང་གིས་རྩོད་པ་ཐམས་ཅད་ཚར་ཆོད་པར་འགྱུར་ཏེ།
en: and the soothsayers will say, ‘The being in her womb will understand all the treatises and confound those who debate the scriptures.

source: དེའི་མཐུས་ན་བྲམ་ཟེ་མོའི་ཡིད་ལ་འདོད་པ།
en: It is on account of that being that the brahmiṇī has such fervent wishes and thinks,

source: གཞུང་གིས་རྩོད་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་སྨྲ་ཡང་ཅི་མ་རུང་སྙམ་པ་དེ་ལྟ་བུ་སྐྱེས་པ་ཡིན་ནོ་ཞེས་ཟེར་རོ། །
en: “Wouldn’t it be good to converse with those who debate the scriptures!” ’

source: དེ་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་པར་གྱུར་ཏེ།
en: “After nine or ten months have passed, she will give birth to a child who is well proportioned, pleasing to the eye, and beautiful.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། བསྟན་བཅོས་ཐམས་ཅད་མཐར་ཕྱིན་པར་འགྱུར་ཞིང་། གཞུང་གིས་རྩོད་པ་ཐམས་ཅད་ཚར་ཆོད་པར་འགྱུར་ལ།
en: When he is grown, he will master all the treatises and confound those who debate the scriptures.

source: བྲམ་ཟེ་ལྔ་བརྒྱ་བྲམ་ཟེའི་སྔགས་སློབ་པའི་སློབ་དཔོན་བྱེད་དེ
en: He will act as a master of disciples of the brahmin mantras for five hundred brahmins.

source: དེ་ལ་སློབ་མ་མང་པོ་ཡོད་པས་ན། དེའི་མིང་སློབ་མ་ཅན་ཞེས་བཏགས་སོ། །
en: He will have many disciples, and therefore he will be called Śiṣyaka.

source: དེ་ནས་དེས་ཕ་མ་ལ་གསོལ་ནས། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ཞིང་སྡེ་སྣོད་གསུམ་ལོབས་པར་འགྱུར་ཏེ།
en: “Then he will ask for his parents’ permission, go forth in my very doctrine, be educated in the Tripiṭaka,

source: རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བར་འགྱུར་ལ་འཁོར་མང་པོ་འདུ་བར་འགྱུར་རོ། །
en: become a proponent of the Dharma with all the eloquence of wisdom and freedom, and gather around himself a great retinue.

source: དབང་པོ་དག་དེ་ཁོ་ནའི་ཚེ་ཡུལ་དམར་ཅན་གྱི་བུ་ཞེས་བྱ་བར་ཚོང་དཔོན་ནོར་བཟངས་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ།
en: “Lords, at the same time, in Pāṭaliputra a trader called Sudhana will appear.

source: དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པར་འགྱུར་ལ། སྲིད་པ་ཐ་མའི་སེམས་ཅན་ཞིག་ཀྱང་དེའི་ཆུང་མའི་ལྟོར་ཞུགས་ནས།
en: When the time comes for him to marry, he will take a wife, they will enjoy themselves and couple, and a being in its final existence will enter his wife’s womb.

source: བུད་མེད་དེ་བཟོད་པ་དང་ལྡན་ཞིང་དེས་ལ་ཁ་མཆུ་ཉུང་ཞིང་ཞི་བར་འགྱུར་རོ། །
en: The woman will become patient, gentle, peaceable, and calm.

source: དེ་ནས་ཚོང་དཔོན་ནོར་བཟངས་ཀྱིས་མཚན་མཁན་རྣམས་ལ་བསྟན་ན། དེ་དག་ན་རེ་སེམས་ཅན་ལྟོར་ཞུགས་པ་དེ་དེས་པར་འགྱུར་ཏེ། དེའི་མཐུས་ན་ཆུང་མ་འདི་བཟོད་པ་དང་ལྡན་ཞིང་དེས་ལ་ཁ་མཆུ་ཉུང་ཞིང་ཞི་བར་གྱུར་ཏོ་ཞེས་ཟེར་རོ། །
en: “When the trader Sudhana consults the soothsayers, they will reply, ‘The being who has entered her womb will be gentle. It is on account of that being that your wife has become patient, gentle, peaceable, and calm.’

source: དེ་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙའ་བར་འགྱུར་ཏེ།
en: After nine or ten months have passed, she will give birth to a child who is well proportioned, pleasing to the eye, and beautiful.

source: དེའི་མིང་དེས་པ་ཞེས་འདོགས་པར་འགྱུར་རོ། །
en: They will name him Sūrata.

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཕ་མ་ལ་གསོལ་ནས། ངའི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བར་འགྱུར་ཏེ། དེས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་ལ།
en: “When he is grown, he will ask for his parents’ permission to go forth in my very doctrine, cast away all afflictive emotions, and manifest arhatship.

source: ཐོས་པ་ཉུང་ཞིང་འདོད་པ་ཆུང་ལ་ཀུན་གྱིས་ཤེས་པ་དང་བས་མཐའི་གནས་མལ་དུ་གནས་པར་འགྱུར་རོ། །
en: He will have little learning and few desires, be known by all, and make his home in a remote place.

source: དེ་ནས་རེ་ཞིག་ན་རྒྱལ་པོ་བཟོད་པར་དཀའ་བའི་ཡབ་དབང་ཆེན་སྡེ་ཤི་ནས།
en: “One day King Duṣprasaha’s father Mahendrasena will die.

source: རྒྱལ་པོ་བཟོད་པར་དཀའ་བས་ཕའི་རུས་བུ་ལག་པ་གཉིས་ཀྱིས་པང་དུ་བླངས་ཏེ་མྱ་ངན་བྱེད་ཅིང་སྡུག་བསྔལ་ལ། སྨྲེ་སྔགས་འདོན་པར་བྱེད་དེ་སུ་ཡང་དེའི་མྱ་ངན་སེལ་ནུས་པ་མེད་དོ། །
en: King Duṣprasaha will take his remains in his hands and cradle them in his lap, grieving and suffering, wailing and lamenting, and there will be no one able to dispel his sorrow.

source: དེ་ནས་རེ་ཞིག་ན་གནས་བརྟན་སློབ་མ་ཅན་འཁོར་བརྒྱ་ཕྲག་དུ་མ་དང་ཡུལ་ཀཽ་ཤཱཾ་བཱིར་འགྲོ་བར་འགྱུར་ཏེ། དེ་རྒྱལ་པོ་བཟོད་པར་དཀའ་བའི་ཐད་དུ་སོང་ནས་ཆོས་སྟོན་པར་འགྱུར་རོ། །
en: “Soon thereafter the elder Śiṣyaka and hundreds of his disciples will travel to Kauśāmbī, where he will go before King Duṣprasaha and teach him the Dharma.

source: དེ་ནས་དེ་ཐོས་ནས་རྒྱལ་པོ་དེ་ཕའི་མྱ་ངན་ཡང་སངས་པར་འགྱུར་ལ། བསྟན་པ་ལ་ཡང་དད་པ་རྙེད་པར་འགྱུར་རོ། །
en: Hearing it will clear away the king’s sorrows, and he will find faith in the doctrine.

source: དེ་དད་པར་གྱུར་ནས་དགེ་སློང་རྣམས་ལ་མི་འཇིགས་པ་སྦྱིན་པར་འགྱུར་རོ། །
en: Now faithful, he will give the gift of protection to the monks.

source: དེ་ནས་དེས་དགེ་སློང་རྣམས་ལ་སྨྲས་པ།
en: He will say to the monks,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་མཐའ་འཁོབ་ཀྱི་རྒྱལ་པོ་རྣམས་ཀྱིས་བཤིག་ནས་ཇི་སྲིད་ལོན།
en: ‘How many years has it been since the Blessed One’s doctrine was destroyed by the kings of the barbaric outlying regions?’

source: དེ་དག་ན་རེ་ལོ་བཅུ་གཉིས་ལོན་ནོ་ཞེས་ཟེར་རོ། །
en: And they will reply, ‘Twelve years.’

source: དེ་ནས་རྒྱལ་པོ་དེས་སེང་གེའི་སྒྲ་བསྒྲགས་ཏེ།
en: Then he will proclaim with a lion’s roar,

source: ངས་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཀཽ་ཤཱཾ་བཱིར་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལོ་ལྔ་པའི་དུས་སྟོན་བྱའོ་ཞེས་སྨྲས་ནས།
en: ‘For twelve years I shall hold a Festival of the Fifth Year of the Doctrine of the Blessed One in Kauśāmbī.’

source: རྒྱལ་པོ་དེས་ཀཽ་ཤཱཾ་བཱིར་ལོ་ལྔ་པའི་དུས་སྟོན་གྱི་ལུགས་གཏོད་དེ། གང་གི་ཉིན་པར་ལོ་ལྔ་པའི་དུས་སྟོན་བརྩམས་པ་དེ་ཁོ་ནའི་ཉིན་པར་ཆར་འབབ་པར་འགྱུར་ཏེ། སའི་སྟེང་རྒྱ་མཚོའི་མཐས་གཏུགས་པ་ཆུས་ངོམས་པར་འགྱུར་རོ། །
en: “When the king inaugurates the Festival of the Fifth Year in Kauśāmbī, on the very day it commences rain will begin to fall, and people the world over will be sated with water, all the way to the ocean’s edge.

source: དེ་ནས་འཛམ་བུའི་གླིང་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་རྣམས་ལྷག་པར་ཡང་ཀཽ་ཤཱཾ་བཱིར་ལོ་ལྔ་པའི་དུས་སྟོན་བྱེད་དུ་འགྲོ་ཞིང་།
en: The many inhabitants of Jambudvīpa will come to Kauśāmbī specifically to celebrate the Festival of the Fifth Year.

source: དགེ་སློང་རྣམས་ཀྱི་མཆོད་པའི་ལས་ལ་བརྩོན་པར་འགྱུར་རོ། །
en: “Monks will put all their efforts into working for offerings.

source: དེ་ནས་དགེ་སློང་རྣམས་རྙེད་པ་དང་བཀུར་སྟི་ཆེན་པོ་ལ་ཞེན་ནས་དེ་དག་གིས་དད་པས་བྱིན་པ་ལོངས་སྤྱོད་པར་བྱེད་དོ། །
en: They will be fixated on worldly profit and high acclaim. They will indulge themselves on donations given in faith.

source: ལུང་མནོད་པར་མི་བྱེད་ཀློག་པར་མི་བྱེད། ཁ་ཏོན་མི་བྱེད།
en: They will not receive instruction, and neither read nor recite.

source: ཉིན་མོ་ནི་བྲེ་མོ་གཏམ་གྱིས་དུས་འདའ་བར་བྱེད། མཚན་མོ་ནི་རྨུགས་པ་དང་གཉིད་ཀྱིས་དུས་འདའ་བར་བྱེད་ཅིང་ཁེ་དང་བཀུར་སྟི་འདོད་ལ།
en: They will pass their days in gossip and their nights in sloth and slumber. They will crave money and acclaim.

source: ལུས་ཀྱི་བྱི་དོར་གྱིས་གཡེན་སྤྱོ་ཞིང་གོས་ཀྱིས་བརྒྱན་པ་ལ་བརྩོན་ཏེ།
en: They will be obsessed with physical hygiene and pour their efforts into their attire.

source: ངེས་པར་འབྱུང་བ་དང་ཉེ་བར་ཞི་བ་དང་དབེན་པ་དང་རྫོགས་པར་བྱང་ཆུབ་པ་དང་བྲལ་ཞིང་།
en: They will have neither renunciation, tranquility, solitude, nor perfect enlightenment.

source: ཆ་བྱད་འབའ་ཞིག་གཅེས་པར་བྱེད་པར་འགྱུར་ཏེ།
en: The only thing dear to them will be their outfits.

source: དགེ་སྦྱོང་གི་ཡོན་ཏན་དང་བྲལ་བ། དམ་པའི་ཆོས་ཀྱི་དགྲར་གྱུར་པ། རྩོད་པའི་དུས་ཀྱི་གྲོགས་སུ་གྱུར་པ་དེ་དག་གིས་ཆོས་ཀྱི་རྒྱལ་མཚན་བསྙལ་བར་འགྱུར། བདུད་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བར་འགྱུར།
en: “Lacking the great virtues of the holy ascetics, and acting as enemies to the holy Dharma and friends with this time of strife, they will lay down the banner of the Dharma and hoist the banner of Māra,

source: ཆོས་ཀྱི་མེ་ལྕེ་གསོད་པར་འགྱུར་ཉོན་མོངས་པའི་མེ་སྦར་བར་འགྱུར།
en: snuff out the flame of Dharma and ignite the flame of afflictive emotions,

source: ཆོས་ཀྱི་རྔ་འདྲལ་བར་འགྱུར།
en: cleave the Dharma drum,

source: དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ཕྱེ་མར་རློག་པར་འགྱུར།
en: grind the wheel of holy Dharma down to dust,

source: དམ་པའི་ཆོས་ཀྱི་རྒྱ་མཚོ་སྐེམས་པར་འགྱུར།
en: let dry up the ocean of holy Dharma,

source: དམ་པའི་ཆོས་ཀྱི་རི་བོ་རྣམ་པར་འཐོར་བར་འགྱུར།
en: level the mountain of holy Dharma,

source: ཆོས་ཀྱི་གྲོང་ཁྱེར་འཇིགས་པར་བྱེད་པར་འགྱུར།
en: raze the city of Dharma to the ground,

source: ཆོས་ཀྱི་ཤིང་ལྗོན་པ་དྲུང་ནས་འབྱིན་པར་འགྱུར།
en: rip out the Dharma tree by its roots,

source: ཞི་གནས་དང་ལྷག་མཐོང་གཉིས་སྤོང་བར་བྱེད།
en: cast aside calm abiding meditation and insight meditation,

source: ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་རྣམས་གཅོད་པར་བྱེད།
en: snip off the adornments of their morality,

source: ལམ་སུན་འབྱིན་པར་བྱེད་དོ།
en: and repudiate the path.

source: དེ་ནས་དེ་དག་ལ་ལྷ་རྣམས་དང་ཀླུ་རྣམས་དང་གནོད་སྦྱིན་རྣམས་དམོད་པར་འགྱུར་སྤང་བར་འགྱུར་བརྒྱལ་བར་འགྱུར་ཏེ།
en: “Then the gods, nāgas, and yakṣas shall curse, desert, and defeat them, saying,

source: ཀྱེ་སེམས་ཅན་ཐ་ཆད་འདི་ལྟ་བུ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་གསུང་རབ་མི་མཛེས་པར་བྱས་སོ་ཞེས་ཟེར་ཏོ། །
en: ‘It isn’t right that these lowest of beings spoil the excellent speech of the Blessed One.’

source: འདི་སྐད་ཅེས་ཀྱང་ཟེར་ཏེ།
en: And they will also say:

source: ད་ནི་མ་བསྡམས་ངན་སྤྱོད་དང་། །ལོག་པར་ལྟ་བས་ཉམས་པའི་བདག །རྨོངས་པ་བདག་གིས་བཅོམ་ལྡན་གྱི། །བསྟན་པའི་ལྗོན་ཤིང་བཅད་ཀྱིས་མེད། །
en: “ ‘These wretched persons, engulfed in wrong views, Whose sorry misdeeds know no bounds, In their benighted state have felled the Blessed One’s teaching, The fruit-bearing tree, and now it’s gone.

source: ད་ནི་སྙིང་རྗེ་མེད་པ་དང་། །ཆོས་ལུགས་བོར་ཞིང་བདེན་ཆོས་སྤངས། །
en: “ ‘The heartless tossed out the Dharma way. The true Dharma they have cast away.

source: བརྐམ་ཆགས་རྣམས་ཀྱིས་བཅོམ་ལྡན་གྱི། །བསྟན་པའི་རྒྱལ་མཚན་བསྙལ་གྱིས་མེད། །
en: In greed, They tore the Dharma banner,

source: ད་ནི་གདུལ་དཀའ་མ་གྲངས་པ། །སྡིག་པའི་ལས་ལ་དགའ་བའི་མི། །སྡིག་ཅན་རྣམས་ཀྱིས་ཐུབ་པ་ཡི། །བསྟན་པའི་ཟམ་པ་བཅད་ཀྱིས་མེད། །
en: the Blessed One’s teaching, Left it on the ground, and now it’s gone. “ ‘These countless restive, wicked persons In the thrall of sin, these evil ones, Destroyed that bridge, the Sage’s teaching, And now it’s gone.

source: ད་ནི་མགོ་རེག་ངན་པ་པོ། །སྤྱོད་འཆལ་སྨད་པ་ཚུལ་འཆོས་གནས། །ངན་གཡོ་ཅན་གྱིས་ཐུབ་པ་ཡི། །བསྟན་པའི་ཚོང་འདུས་བཅོམ་གྱིས་མེད། །
en: “ ‘These ignoble persons with shaven heads, Lax in conduct, whose lives are a ploy, Dishonest folk, have destroyed that market, The Sage’s teaching, and now it’s gone.

source: ད་ནི་ཁྲོ་དང་ང་རྒྱལ་དང་། །རྒྱགས་པས་བརླམས་ཤིང་རྙེད་ལ་ཞེན། །སྙིང་རྗེ་མེད་པ་དེ་དག་གིས། །སྡིག་པ་མི་བྱེད་ཅི་ཡང་མེད། །
en: “ ‘Anger, pride, and arrogance Like foul spirits possess them. Fond of money, inhumane—other than evil, They’ve done nothing at all.

source: ད་ནི་དམ་ཆོས་འཇིག་པའི་ཚེ། །
en: “ ‘Now is the time that the holy Dharma is razed.

source: རྟགས་མཚན་ཤིན་ཏུ་མི་བཟད་པ། །
en: The signs, they tell an awful tale.

source: དགེ་བ་རྣམས་ནི་སྐྱོ་འགྱུར་བ། །
en: The virtuous are filled with grief;

source: སྟོན་པ་དེ་ཉིད་གཟིགས་པ་པོ། །
en: The teacher, he saw it all.

source: དྲང་སྲོང་དམ་པས་གང་གསུངས་པ། །དེ་དག་ཀྱང་ནི་སྣང་བར་འགྱུར། །
en: “ ‘All of what the perfect sage predicted, Everything has come to pass—

source: ད་ནི་ཐུབ་པའི་བསྟན་པ་ཡང་། །ཅུང་ཟད་ཙམ་ཞིག་ལུས་པར་ཟད། །
en: A trifling remnant of the Sage’s teaching Remained, and now it’s gone.

source: ཐུབ་པའི་བསྟན་པ་གང་ཆེན་མཚོ། །རིང་པོར་མི་ཐོགས་སྐམས་པར་འགྱུར། །
en: “ ‘The ocean of the Sage’s teaching Will be a wasteland before long.

source: མ་རབས་ཤེས་རབ་འཆལ་པ་དང་། །ལས་མེད་གནས་པས་གནོད་པར་བྱས། །
en: The wanton, with their vulgar wisdom, Through negligence have done their harm.

source: ཚུལ་ཅན་དག་དང་སྟེན་མི་ཤེས། །
en: “ ‘They don’t know how to serve the just.

source: ཉེས་པ་འཛིན་ཅིང་ཚུལ་ཁྲིམས་སྤངས། །
en: They cling to faults and abandon good.

source: བྱིས་པ་དབེན་པས་འཇིགས་པ་དང་། །མི་དབེན་པ་དང་མི་མཁས་དང་། །
en: Like children, fearful when alone, They are never in solitude, ever unaware.

source: བསླབ་ཉེས་སློབ་དཔོན་ངན་པ་དང་། །རྗེས་སུ་སྟོན་པ་རྨོངས་པ་དང་། །
en: “ ‘These deluded persons, trailing after Nasty masters who were poorly trained,

source: ངན་པ་དག་ལ་ཡིད་རྟོན་པས། །དམ་ཆོས་འདི་ནི་མ་རུང་བྱས། །
en: Convinced of what is totally wrong, Have spoiled the Dharma, and now it’s gone.

source: དེ་སྐད་ཅེས་ཟེར་ཞིང་མི་མགུ་ལ་མ་རངས་ནས། ཕྱིན་ཅད་དགེ་སློང་རྣམས་ལ་བསྲུང་བ་དང་སྦེད་པར་མི་བྱེད་དོ། །
en: “After they speak these words, in bitter disappointment never again will the gods, nāgas, and yakṣas look after the monks or shelter them.

source: དེ་ནས་ཞག་བདུན་ན་དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་བ་ན། ལྷ་རྣམས་ཡིད་མི་དགའ་ནས་ནམ་མཁའ་ལ་འཁོད་དེ་སྐད་འབྱིན་ཅིང་སྒྲ་བསྒྲགས་ཏེ།
en: With the holy Dharma due to vanish in seven days’ time, the gods will be unhappy and hover in the sky, crying out this pronouncement:

source: གྲོགས་པོ་དག་ད་སྟེ་ཞག་བདུན་ན་གསོ་སྦྱོང་གི་དུས་ལ་བབ་པའི་ཚེ། དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་ཐབ་མོས་ནུབ་པར་འགྱུར་རོ་ཞེས་ཟེར་ཏོ། །
en: ‘Friends, seven days from now, when the time comes for the poṣadha purification ceremony, the holy Dharma of the Tathāgata will vanish because of a dispute.’

source: དེ་ནས་དེ་ཐོས་ནས་ཀཽ་ཤཱཾ་བཱི་ན་གནས་པའི་དགེ་བསྙེན་ལྔ་བརྒྱ་གཙུག་ལག་ཁང་དུ་དོང་ནས་དགེ་སློང་རྣམས་འཐབ་པ་དང་མཚང་འདྲུ་བ་དང་འགྱེད་པ་དང་རྩོད་པ་བྱུང་ངོ་ཅོག་ཞི་བར་བྱེད་དེ
en: “Upon hearing this, five hundred lay vow holders of Kauśāmbī will go to the monastery to pacify all the monks’ fighting, faultfinding, quarrels, and disputes, protesting,

source: འདི་སྐད་དུ་ཀྱི་ཧུད་སངས་རྒྱས་ཀྱི་བསྟན་པ་རིང་པོར་མི་ཐོགས་པར་ཐབ་མོས་ནུབ་པར་འགྱུར་རོ་ཞེས་ཟེར་རོ། །
en: ‘Alas! The Buddha’s doctrine will vanish soon because of a dispute.’

source: སེམས་ཅན་ཀུན་ལ་བདེ་བྱེད་པ། །ཤཱཀྱ་སེང་གེའི་བསྟན་པ་ནི། །དུས་ཀྱི་འཁོར་ལོས་རབ་བཅོམ་ནས། །མྱུར་བ་ཉིད་དུ་འཇིག་པར་འགྱུར། །གང་དག་འདི་འདྲའི་དུས་བབ་ཚེ། །
en: “ ‘The Śākya lion’s teaching That gladdened every being Very soon will be destroyed, Crushed beneath the wheel of time.

source: སྙིང་ནི་སྟོང་དུ་མ་གས་པ། །
en: “ ‘Many a thousand hearts are broken.

source: བདག་ཉིད་ཆེན་པོ་དེ་དག་གི། །སྙིང་གི་ལྕགས་ཀྱི་སྙིང་པོ་ཟད། །
en: Even the greatest, made of iron—done.

source: ཞི་བའི་དུས་ནི་འདས་པར་གྱུར། །
en: The peaceful times are now long past.

source: མི་བཟད་དུས་ནི་བྱུང་གིས་མེད། །
en: A dreadful time has come. It’s gone.

source: ཤེས་རབ་ཅན་གྱི་མི་རྣམས་ནི། །འཇིག་རྟེན་དག་ན་ཟད་པར་འགྱུར། །
en: “ ‘The wise of the world Have dwindled to none.

source: ས་སྟེང་རྟགས་རྣམས་ཅི་འདྲ་བར། །རྣམ་པ་དུ་མ་སྣང་བ་ལས། །
en: All the signs upon earth, Whatever forms they take, concur:

source: ངེས་པར་ཐུབ་པའི་བསྟན་པ་ནི། །རིང་པོ་མི་ཐོགས་འཇིག་པར་འགྱུར། །
en: “ ‘It’s certain that the doctrine Will fall to ruin before long.

source: བདེ་འདོད་རྣམས་ཀྱིས་ཕན་པའི་དོན། །ད་ནི་ལེགས་པར་བརྟག་པར་རིགས། །ད་ནི་དམ་པའི་ཆོས་ནུབ་པས། །
en: Think well, those who wish for happiness, What could be of benefit. “ ‘Know it now, think well on this— That the true Dharma is vanishing.

source: མཆོད་པ་དཔག་ཏུ་མེད་པ་ལས། །ཚད་ཡོད་པ་ཅན་དུ་འགྱུར་རོ། །
en: Where before there was boundless worship Now a mere measure remains.

source: དེ་བས་ན་བདག་ཅག་གིས་ལོངས་སྤྱོད་སྙིང་པོ་མེད་པ་ལས་སྙིང་པོ་བླང་བར་བྱའོ་སྙམ་ནས་
en: “Thus the five hundred lay vow holders will come to reflect, ‘Common enjoyments are meaningless. We should do something more meaningful.’

source: དགེ་བསྙེན་ལྔ་བརྒྱ་པོ་དེ་དག་གིས། གང་གི་ཉིན་པར་དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་བ་དེ་ཁོ་ནའི་ཉིན་པར་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་ཞལ་སྲོ་བར་འགྱུར་རོ། །
en: And so, on the very day when the holy Dharma is to disappear, the group of five hundred lay vow holders will provide support for five hundred monasteries.

source: དེ་ནས་གསོ་སྦྱོང་གི་དུས་ལ་བབ་པ་ན་དགེ་བསྙེན་ལྔ་བརྒྱ་པོ་རྣམས་བྲེལ་ཏེ། གཙུག་ལག་ཁང་དུ་འགྲོ་མི་ནུས་པར་འགྱུར་རོ། །
en: But when it comes time for poṣadha, the five hundred lay vow holders will be occupied and will not be able to go to the monastery.

source: དེ་ནས་རེ་ཞིག་ན་དགེ་སློང་དེས་པ་རི་སྤོས་ཀྱི་ངད་ལྡང་ན་གནས་པ་ལས་གང་དུ་གསོ་སྦྱོང་བྱ་སྙམ་སྟེ།
en: “Meanwhile the monk Sūrata, living upon Gandhamādana Mountain, will wonder, ‘Where should I go to convene for poṣadha?’

source: འཛམ་བུའི་གླིང་དུ་བལྟས་ན། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་ཐམས་ཅད་ཀཽ་ཤཱཾ་བཱིར་འདུས་པར་མཐོང་ངོ་། །
en: When he looks out toward Jambudvīpa, seeing all the Blessed One’s disciples converging upon Kauśāmbī,

source: དེ་ནས་དེ་གསོ་སྦྱོང་བྱ་བའི་ཕྱིར་ཀཽ་ཤཱཾ་བཱིར་འགྲོ་བར་འགྱུར་རོ། །
en: he will wish to travel to Kauśāmbī for poṣadha.

source: དེར་དགེ་སློང་འབུམ་གསོ་སྦྱོང་ལ་འདུ་བར་འགྱུར་ཏེ། དེའི་ནང་ན་དགྲ་བཅོམ་པ་ནི་དེས་པ་ཞེས་བྱ་བ་གཅིག་པུ་ཡོད་དོ། །
en: Among the hundred thousand monks assembled for poṣadha, there will be but a single arhat, the one called Sūrata,

source: སྡེ་སྣོད་གསུམ་པ་ནི་སློབ་མ་ཅན་ཞེས་བྱ་བ་གཅིག་པུ་ཡོད་དོ། །
en: and there will be but a single Tripiṭaka master, the one called Śiṣyaka.

source: དབང་པོ་དག་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་འདུས་པ་ཐ་མ་ཡིན་ཏེ།
en: “Lords, that will be the final gathering of the Tathāgata’s disciples.

source: འདི་ལྟ་སྟེ། དགེ་སློང་འབུམ་ཡོད་དོ། །
en: One hundred thousand monks will be there.
